Results/2xx/aggregate 2.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
GET /api/products/{id},67,10,9,13,15,26,7,26,0.000%,.00463,0.00,0.00
POST /api/auth/login,40,9,10,11,12,20,8,20,0.000%,.00275,0.00,0.00
GET /api/reports/sales,45,2505,2511,2519,2526,2529,2190,2529,2.222%,.00308,0.00,0.00
GET /api/products,29,10,9,13,16,18,7,18,0.000%,.00200,0.00,0.00
GET /api/health,21,3,3,5,6,7,2,7,0.000%,.00143,0.00,0.00
GET /api/orders/{id},54,10,10,13,15,15,7,19,0.000%,.00373,0.00,0.00
GET /api/auth/profile,33,3,3,5,6,13,2,13,24.242%,.00231,0.00,0.00
GET /api/reports/slow,41,3004,3004,3009,3010,3018,3002,3018,0.000%,.00284,0.00,0.00
POST /api/orders,23,11,11,13,17,17,9,17,0.000%,.00169,0.00,0.00
POST /api/reports/generate,18,4892,5003,6007,7003,7006,3004,7006,0.000%,.00131,0.00,0.00
TOTAL,371,879,10,3004,3009,6003,2,7006,2.426%,.02530,0.02,0.00