Results/2xx/summary 2.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
GET /api/products/{id},67,10,7,26,3.56,0.000%,.00463,0.00,0.00,395.6
POST /api/auth/login,40,9,8,20,1.95,0.000%,.00275,0.00,0.00,350.0
GET /api/reports/sales,45,2505,2190,2529,47.91,2.222%,.00308,0.00,0.00,1517.4
GET /api/products,29,10,7,18,2.40,0.000%,.00200,0.00,0.00,2314.0
GET /api/health,21,3,2,7,1.28,0.000%,.00143,0.00,0.00,233.0
GET /api/orders/{id},54,10,7,19,2.12,0.000%,.00373,0.00,0.00,353.9
GET /api/auth/profile,33,3,2,13,1.92,24.242%,.00231,0.00,0.00,222.6
GET /api/reports/slow,41,3004,3002,3018,3.34,0.000%,.00284,0.00,0.00,257.0
POST /api/orders,23,11,9,17,1.93,0.000%,.00169,0.00,0.00,228.3
POST /api/reports/generate,18,4892,3004,7006,1242.52,0.000%,.00131,0.00,0.00,275.0
TOTAL,371,879,2,7006,1490.65,2.426%,.02530,0.02,0.00,614.5